Ran Apply for dir: `aws/lincoln/dev/vpces/app/services/common/sg` workspace: `default`

**Apply Error**
<details><summary>Show Output</summary>

```
exit status 1: running "terragrunt apply -no-color" in "/home/atlantis/.atlantis/repos/unknownhosts/unknownhosts-terraform/27/default/aws/lincoln/dev/vpces/app/services/common/sg": 

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.test will be created
  + resource "aws_security_group" "test" {
      + arn                    = (known after apply)
      + description            = "test-sg"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "in_443"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "test-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"  = "test-sg"
          + "Owner" = "jordan.kim"
        }
      + tags_all               = {
          + "EnvironmentName" = "dev"
          + "Name"            = "test-sg"
          + "Owner"           = "jordan.kim"
          + "ProjectName"     = "lincoln"
          + "ResourceName"    = "sg"
          + "TerraformPath"   = "vpces/app/services/common/sg"
        }
      + vpc_id                 = "vpc-0c7e81e5613747c93"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: 
Error: error asking for approval: EOF

time=2022-10-21T00:58:53Z level=error msg=1 error occurred:
	* exit status 1




```
</details>

